nxp-appcodehub/dm-mc-pmsm-triple-mcxa34x/board/pin_mux.c
/*
 * Copyright 2025 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v16.0
processor: MCXA166
package_id: MCXA166VLL
mcu_data: ksdk2_0
processor_version: 0.16.12
external_user_signals: {}
pin_labels:
- {pin_num: '71', pin_signal: P3_6/CLKOUT/LPSPI1_PCS3/LPUART3_RTS_B/CT4_MAT2/PWM0_A3/PWM1_A0/EZH_PIO6/FREQME_CLK_OUT1/ADC3_A12, label: PFC_AT, identifier: LED_GREEN;PFC_AT}
- {pin_num: '73', pin_signal: P3_0/WUU0_IN22/TRIG_IN0/LPUART3_RXD/CT_INP16/PWM0_A0/PWM1_X0/EZH_PIO0, label: MC1_AT, identifier: CompUH;Compressor_UH;MC1_AT}
- {pin_num: '69', pin_signal: P3_8/WUU0_IN23/TRIG_IN3/LPSPI1_SDO/LPUART1_RXD/CT_INP4/PWM0_A1/LPUART5_CTS_B/EZH_PIO8/CLKOUT, label: MC1_BT, identifier: Compressor_VH;MC1_BT}
- {pin_num: '67', pin_signal: P3_10/TRIG_IN5/LPSPI1_SCK/LPUART1_RTS_B/CT1_MAT0/PWM0_A2/LPUART5_TXD/EZH_PIO10, label: MC1_CT, identifier: Compressor_WH;MC1_CT}
- {pin_num: '72', pin_signal: P3_1/TRIG_IN1/LPUART3_TXD/CT_INP17/PWM0_B0/PWM1_X1/EZH_PIO1/FREQME_CLK_OUT0, label: MC1_AB, identifier: Compressor_UL;MC1_AB}
- {pin_num: '68', pin_signal: P3_9/TRIG_IN4/LPSPI1_SDI/LPUART1_TXD/CT_INP5/PWM0_B1/LPUART5_RTS_B/EZH_PIO9, label: MC1_BB, identifier: Compressor_VL;MC1_BB}
- {pin_num: '66', pin_signal: P3_11/WUU0_IN24/TRIG_IN6/LPSPI1_PCS0/LPUART1_CTS_B/CT1_MAT1/PWM0_B2/LPUART5_RXD/EZH_PIO11, label: MC1_CB, identifier: Compressor_WL;MC1_CB}
- {pin_num: '29', pin_signal: P2_7/TRIG_IN5/LPUART4_TXD/CT_INP19/CT1_MAT3/EZH_PIO31/VREFI/ADC1_A7/ADC3_A7/ADC0_A7/ADC2_A7, label: Compressor_FO, identifier: Compressor_FO}
- {pin_num: '49', pin_signal: P3_30/TRIG_OUT6/LPI2C3_SCLS/LPUART4_RTS_B/CT0_MAT2/PWM1_A0/EZH_PIO30/ADC1_A21, label: MC3_VOLT_DCB, identifier: Fan_UH;MC3_VOLT_DCB}
- {pin_num: '61', pin_signal: P3_14/WUU0_IN25/LPUART2_RXD/LPUART3_CTS_B/CT_INP6/PWM0_X2/PWM1_A1/EZH_PIO14/ADC3_A16, label: MC2_BT, identifier: Fan_VH;MC2_BT}
- {pin_num: '63', pin_signal: P3_12/LPUART2_RTS_B/LPUART3_TXD/CT1_MAT2/PWM0_X0/PWM1_A2/EZH_PIO12/ADC3_A14, label: MC2_CT, identifier: Fan_WH;MC2_CT}
- {pin_num: '62', pin_signal: P3_13/LPUART2_CTS_B/LPUART3_RXD/CT1_MAT3/PWM0_X1/PWM1_B2/EZH_PIO13/ADC3_A15, label: MC2_CB, identifier: Fan_WL;MC2_CB}
- {pin_num: '60', pin_signal: P3_15/LPUART2_TXD/LPUART3_RTS_B/CT_INP7/PWM0_X3/PWM1_B1/EZH_PIO15/ADC3_A17, label: MC2_BB, identifier: Fan_VL;MC2_BB}
- {pin_num: '48', pin_signal: P3_31/LPTMR0_ALT2/TRIG_IN10/LPI2C3_SDAS/LPUART4_CTS_B/CT0_MAT3/PWM1_B0/EZH_PIO31/ADC1_A20, label: MC1_ENC_I, identifier: Fan_UL;MC1_ENC_I}
- {pin_num: '52', pin_signal: P3_27/WUU0_IN30/TRIG_OUT7/LPI2C3_SCL/LPUART4_TXD/CT_INP13/CT3_MAT1/PWM1_A3/EZH_PIO27, label: MC3_AT, identifier: PFC_PWM;MC3_AT}
- {pin_num: '26', pin_signal: P2_4/LPUART2_CTS_B/CT_INP14/CT1_MAT0/EZH_PIO28/ADC0_A1/ADC2_A0/CMP2_IN0, label: ENV_TEMP, identifier: PFC_IDC;ENV_TEMP}
- {pin_num: '25', pin_signal: P2_3/WUU0_IN19/TRIG_IN7/LPUART0_CTS_B/LPUART2_RXD/CT_INP13/CT2_MAT3/EZH_PIO27/ADC0_A3/CMP1_IN0/ADC1_A4, label: MC3_CUR_DCB, identifier: MC3_CUR_DCB}
- {pin_num: '80', pin_signal: P0_6/ISPMODE_N/LPI2C0_HREQ/LPSPI0_PCS1/CT_INP2/EZH_PIO2/CMP1_OUT/CLKOUT/ADC0_A15, label: C_IPMT, identifier: C_IPMT}
- {pin_num: '100', pin_signal: P1_7/WUU0_IN9/TRIG_OUT2/LPUART2_CTS_B/CT_INP7/CT4_MAT1/EZH_PIO3/ADC0_A23, label: MC1_TA, identifier: EXH_TEMP;MC1_TA}
- {pin_num: '27', pin_signal: P2_5/LPUART2_RTS_B/CT_INP15/CT1_MAT1/EZH_PIO29/ADC1_A1/ADC3_A0, label: MC3_I_phC, identifier: F_IPMT;MC3_I_phC}
- {pin_num: '3', pin_signal: P1_10/LPUART1_RTS_B/LPI2C2_SDAS/CT2_MAT0/EZH_PIO6/LPUART5_TXD/CAN0_TXD/ADC1_A8, label: MC2_I_phA, identifier: UDCB;MC2_I_phA;MC1_Temp_IPM}
- {pin_num: '4', pin_signal: P1_11/WUU0_IN11/TRIG_OUT2/LPUART1_CTS_B/LPI2C2_SCLS/CT2_MAT1/EZH_PIO7/LPUART5_RXD/CAN0_RXD/ADC1_A9, label: MC2_I_phB, identifier: PFC_I;MC2_I_phB;MC1_TA}
- {pin_num: '5', pin_signal: P1_12/WUU0_IN12/LPI2C1_SDA/LPUART2_RXD/CT2_MAT2/EZH_PIO8/LPUART5_CTS_B/ADC1_A10, label: MC2_I_phC, identifier: VAC;MC2_I_phC}
- {pin_num: '6', pin_signal: P1_13/TRIG_IN3/LPI2C1_SCL/LPUART2_TXD/CT2_MAT3/EZH_PIO9/LPUART5_RTS_B/ADC1_A11, label: MC2_VOLT_DCB, identifier: RLY_IN;AA;RALAY;MCU_BRAKE;MC2_VOLT_DCB}
- {pin_num: '70', pin_signal: P3_7/TRIG_IN2/LPSPI1_PCS2/LPUART3_CTS_B/CT4_MAT3/PWM0_B3/PWM1_B0/EZH_PIO7/ADC3_A13, label: PFC_BT, identifier: wn4;WV4;PFC_BT}
- {pin_num: '10', pin_signal: P1_30/TRIG_OUT3/LPI2C0_SDA/CT_INP16/XTAL48M, label: EVALVE0, identifier: EVALVE0}
- {pin_num: '98', pin_signal: P1_5/FREQME_CLK_IN1/LPSPI0_PCS2/LPUART2_TXD/CT1_MAT3/EZH_PIO1/ADC0_A21/CMP1_IN2, label: MC1_VOLT_DCB, identifier: EVALVE1;MC1_VOLT_DCB}
- {pin_num: '99', pin_signal: P1_6/TRIG_IN2/LPSPI0_PCS1/LPUART2_RTS_B/CT_INP6/CT4_MAT0/EZH_PIO2/ADC0_A22, label: MC1_Temp_IPM, identifier: EVALVE2;MC1_Temp_IPM}
- {pin_num: '51', pin_signal: P3_28/WUU0_IN26/TRIG_IN11/LPI2C3_SDA/LPUART4_RXD/CT_INP12/CT3_MAT2/PWM1_B3/EZH_PIO28, label: MC3_AB, identifier: EVALVE3;MC3_AB}
- {pin_num: '97', pin_signal: P1_4/WUU0_IN8/FREQME_CLK_IN0/LPSPI0_PCS3/LPUART2_RXD/CT1_MAT2/EZH_PIO0/ADC0_A20/CMP0_IN2, label: MC2_FAULT, identifier: PFC_OC;MC1_VOLT_DCB;MC2_FAULT}
- {pin_num: '50', pin_signal: P3_29/WUU0_IN27/ISPMODE_N/LPI2C3_HREQ/CT_INP3/CT3_MAT3/EZH_PIO29/ADC1_A22, label: USER_LED, identifier: USER_LED}
- {pin_num: '44', pin_signal: P2_25/TRIG_OUT7/CT_INP9/ADC3_A3, label: LED_RED, identifier: LED_RED}
- {pin_num: '57', pin_signal: P3_18/LPUART4_RXD/CT2_MAT0/PWM0_X0/PWM1_X0/EZH_PIO18, label: RLY_IN, identifier: RALAY;RLY_IN}
- {pin_num: '42', pin_signal: P2_23/TRIG_OUT5/CT2_MAT3/ADC3_A2/OPAMP3_OUT, label: MCU_BRAKE, identifier: MCU_BRAKE}
- {pin_num: '87', pin_signal: P0_20/WUU0_IN4/LPUART0_RXD/CT_INP0/EZH_PIO10/CMP2_OUT/ADC0_A10, label: MC1_I_phA, identifier: I_phA;MC1_I_phA}
- {pin_num: '88', pin_signal: P0_21/LPUART0_TXD/CT_INP1/EZH_PIO11/ADC0_A11, label: MC1_I_phB, identifier: MC1_;MC1_I_phB}
- {pin_num: '89', pin_signal: P0_22/LPUART0_RTS_B/CT_INP2/CT0_MAT0/EZH_PIO12/ADC0_A12, label: MC1_I_phC, identifier: MC1_I_phC}
- {pin_num: '90', pin_signal: P0_23/WUU0_IN5/LPUART0_CTS_B/CT_INP3/CT0_MAT1/EZH_PIO13/ADC0_A13/CMP2_IN2, label: MC1_CUR_DCB, identifier: MC1_CUR_DCB}
- {pin_num: '7', pin_signal: P1_14/LPI2C1_SCLS/LPUART2_RTS_B/CT3_MAT0/EZH_PIO10/ADC1_A12, label: MC2_CUR_DCB, identifier: MC2_CUR_DCB}
- {pin_num: '8', pin_signal: P1_15/WUU0_IN13/LPI2C1_SDAS/LPUART2_CTS_B/CT3_MAT1/EZH_PIO11/ADC1_A13, label: MC3_I_phA, identifier: MC3_I_phB;MC3_I_phA}
- {pin_num: '23', pin_signal: P2_1/TRIG_IN7/LPUART0_TXD/LPUART4_RTS_B/CT_INP17/CT2_MAT1/EZH_PIO25/ADC1_A0/OPAMP2_INN, label: MC3_I_phB, identifier: MC3_I_phB}
- {pin_num: '91', pin_signal: P1_0/WUU0_IN6/LPTMR0_ALT3/TRIG_IN0/LPSPI0_SDO/LPI2C1_SDA/CT_INP4/CT0_MAT2/ADC0_A16/CMP0_IN3, label: FAULT_1, identifier: FAULT_1}
- {pin_num: '92', pin_signal: P1_1/TRIG_IN1/LPSPI0_SCK/LPI2C1_SCL/CT_INP5/CT0_MAT3/ADC0_A17/CMP1_IN3, label: FAULT_2, identifier: FAULT_2}
- {pin_num: '59', pin_signal: P3_16/LPUART4_RTS_B/CT_INP8/PWM1_A0/EZH_PIO16, label: MC2_AT, identifier: MC2_AT}
- {pin_num: '58', pin_signal: P3_17/LPUART4_CTS_B/CT_INP9/PWM1_B0/EZH_PIO17, label: MC2_AB, identifier: MC2_AB}
- {pin_num: '54', pin_signal: P3_21/TRIG_OUT1/LPI2C3_SCL/LPUART1_TXD/CT2_MAT3/PWM0_X3/PWM1_B3/EZH_PIO21/ADC3_A19, label: MC3_BB, identifier: MC3_BT;MC3_BB}
- {pin_num: '53', pin_signal: P3_22/LPUART1_RTS_B/CT_INP10/PWM1_X2/EZH_PIO22/ADC3_A20, label: MC3_BT, identifier: MC3_BB;MC3_BT}
- {pin_num: '56', pin_signal: P3_19/LPUART4_TXD/CT2_MAT1/PWM0_X1/PWM1_X1/EZH_PIO19, label: MC3_CT, identifier: MC3_CT}
- {pin_num: '55', pin_signal: P3_20/TRIG_OUT0/LPI2C3_SDA/LPUART1_RXD/CT2_MAT2/PWM0_X2/PWM1_A3/EZH_PIO20/ADC3_A18, label: MC3_CB, identifier: MC3_CB}
- {pin_num: '40', pin_signal: P2_20/TRIG_IN8/LPSPI1_PCS2/CT2_MAT0/EZH_PIO22/ADC2_A6/OPAMP3_INP, label: MC1_ENC_A, identifier: MC1_ENC_A}
- {pin_num: '41', pin_signal: P2_21/TRIG_IN9/LPSPI1_PCS3/CT2_MAT1/EZH_PIO23/ADC3_A6/OPAMP3_INN, label: MC1_ENC_B, identifier: MC1_ENC_B}
- {pin_num: '20', pin_signal: P4_6/TRIG_IN4/LPI2C2_HREQ/LPUART3_CTS_B/CT_INP6/PWM0_A0/EZH_PIO26/ADC2_A22, label: MC2_ENC_A, identifier: MC2_ENC_A}
- {pin_num: '21', pin_signal: P4_7/TRIG_IN5/LPUART3_RTS_B/CT_INP7/PWM0_B0/EZH_PIO27/ADC2_A23, label: MC2_ENC_B, identifier: MC2_ENC_B}
- {pin_num: '85', pin_signal: P0_18/LPI2C0_SCLS/CT0_MAT2/EZH_PIO8/CMP0_OUT/ADC0_A8, label: I_pfc1, identifier: I_pfc1}
- {pin_num: '86', pin_signal: P0_19/WUU0_IN3/LPI2C0_SDAS/CT0_MAT3/EZH_PIO9/CMP1_OUT/ADC0_A9, label: I_pfc2, identifier: I_pfc2}
- {pin_num: '28', pin_signal: P2_6/TRIG_OUT4/LPSPI1_PCS1/LPUART4_RXD/CT_INP18/CT1_MAT2/EZH_PIO30/ADC1_A3/ADC2_A2/OPAMP2_OUT, label: MC3_CUR_DCB, identifier: MC3_CUR_DCB}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_port.h"
#include "fsl_gpio.h"
#include "fsl_inputmux.h"
#include "pin_mux.h"

