nxp-appcodehub/dm-mc-pmsm-triple-mcxa34x/board/pin_mux.c
    /* PORT1_1 (pin 92) is configured as TRIG_IN1 */
    PORT_SetPinMux(BOARD_INITPWM0PINS_FAULT_2_PORT, BOARD_INITPWM0PINS_FAULT_2_PIN, kPORT_MuxAlt1);

    PORT1->PCR[1] = ((PORT1->PCR[1] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_IBE_MASK)))

                     /* Input Buffer Enable: Enables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT3_0 (pin 73) is configured as PWM0_A0 */
    PORT_SetPinMux(BOARD_INITPWM0PINS_MC1_AT_PORT, BOARD_INITPWM0PINS_MC1_AT_PIN, kPORT_MuxAlt5);

    PORT3->PCR[0] = ((PORT3->PCR[0] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_IBE_MASK)))

                     /* Input Buffer Enable: Enables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT3_1 (pin 72) is configured as PWM0_B0 */
    PORT_SetPinMux(BOARD_INITPWM0PINS_MC1_AB_PORT, BOARD_INITPWM0PINS_MC1_AB_PIN, kPORT_MuxAlt5);

    PORT3->PCR[1] = ((PORT3->PCR[1] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_IBE_MASK)))

                     /* Input Buffer Enable: Enables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT3_10 (pin 67) is configured as PWM0_A2 */
    PORT_SetPinMux(BOARD_INITPWM0PINS_MC1_CT_PORT, BOARD_INITPWM0PINS_MC1_CT_PIN, kPORT_MuxAlt5);

    PORT3->PCR[10] = ((PORT3->PCR[10] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT3_11 (pin 66) is configured as PWM0_B2 */
    PORT_SetPinMux(BOARD_INITPWM0PINS_MC1_CB_PORT, BOARD_INITPWM0PINS_MC1_CB_PIN, kPORT_MuxAlt5);

    PORT3->PCR[11] = ((PORT3->PCR[11] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT3_6 (pin 71) is configured as PWM0_A3 */
    PORT_SetPinMux(BOARD_INITPWM0PINS_PFC_AT_PORT, BOARD_INITPWM0PINS_PFC_AT_PIN, kPORT_MuxAlt5);

    PORT3->PCR[6] = ((PORT3->PCR[6] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_IBE_MASK)))

                     /* Input Buffer Enable: Enables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT3_7 (pin 70) is configured as PWM0_B3 */
    PORT_SetPinMux(BOARD_INITPWM0PINS_PFC_BT_PORT, BOARD_INITPWM0PINS_PFC_BT_PIN, kPORT_MuxAlt5);

    PORT3->PCR[7] = ((PORT3->PCR[7] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_IBE_MASK)))

                     /* Input Buffer Enable: Enables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT3_8 (pin 69) is configured as PWM0_A1 */
    PORT_SetPinMux(BOARD_INITPWM0PINS_MC1_BT_PORT, BOARD_INITPWM0PINS_MC1_BT_PIN, kPORT_MuxAlt5);

    PORT3->PCR[8] = ((PORT3->PCR[8] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_IBE_MASK)))

                     /* Input Buffer Enable: Enables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT3_9 (pin 68) is configured as PWM0_B1 */
    PORT_SetPinMux(BOARD_INITPWM0PINS_MC1_BB_PORT, BOARD_INITPWM0PINS_MC1_BB_PIN, kPORT_MuxAlt5);

    PORT3->PCR[9] = ((PORT3->PCR[9] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_IBE_MASK)))

                     /* Input Buffer Enable: Enables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe1));
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPWM1Pins:
- options: {callFromInitBoot: 'true', coreID: cm33_core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '59', peripheral: FlexPWM1, signal: 'A, 0', pin_signal: P3_16/LPUART4_RTS_B/CT_INP8/PWM1_A0/EZH_PIO16, direction: OUTPUT}
  - {pin_num: '58', peripheral: FlexPWM1, signal: 'B, 0', pin_signal: P3_17/LPUART4_CTS_B/CT_INP9/PWM1_B0/EZH_PIO17, direction: OUTPUT}
  - {pin_num: '61', peripheral: FlexPWM1, signal: 'A, 1', pin_signal: P3_14/WUU0_IN25/LPUART2_RXD/LPUART3_CTS_B/CT_INP6/PWM0_X2/PWM1_A1/EZH_PIO14/ADC3_A16, identifier: MC2_BT,
    direction: OUTPUT}
  - {pin_num: '60', peripheral: FlexPWM1, signal: 'B, 1', pin_signal: P3_15/LPUART2_TXD/LPUART3_RTS_B/CT_INP7/PWM0_X3/PWM1_B1/EZH_PIO15/ADC3_A17, identifier: MC2_BB,
    direction: OUTPUT}
  - {pin_num: '63', peripheral: FlexPWM1, signal: 'A, 2', pin_signal: P3_12/LPUART2_RTS_B/LPUART3_TXD/CT1_MAT2/PWM0_X0/PWM1_A2/EZH_PIO12/ADC3_A14, identifier: MC2_CT,
    direction: OUTPUT}
  - {pin_num: '62', peripheral: FlexPWM1, signal: 'B, 2', pin_signal: P3_13/LPUART2_CTS_B/LPUART3_RXD/CT1_MAT3/PWM0_X1/PWM1_B2/EZH_PIO13/ADC3_A15, identifier: MC2_CB,
    direction: OUTPUT}
  - {pin_num: '52', peripheral: FlexPWM1, signal: 'A, 3', pin_signal: P3_27/WUU0_IN30/TRIG_OUT7/LPI2C3_SCL/LPUART4_TXD/CT_INP13/CT3_MAT1/PWM1_A3/EZH_PIO27, identifier: MC3_AT,
    direction: OUTPUT}
  - {pin_num: '51', peripheral: FlexPWM1, signal: 'B, 3', pin_signal: P3_28/WUU0_IN26/TRIG_IN11/LPI2C3_SDA/LPUART4_RXD/CT_INP12/CT3_MAT2/PWM1_B3/EZH_PIO28, identifier: MC3_AB,
    direction: OUTPUT}
  - {peripheral: FlexPWM1, signal: 'PWM_FAULT_TRG_CH, 0', pin_signal: cmp0_out}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPWM1Pins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPWM1Pins(void)
{
    /* INPUTMUX0: Peripheral clock is enabled */
    CLOCK_EnableClock(kCLOCK_GateINPUTMUX0);
    /* PORT3: Peripheral clock is enabled */
    CLOCK_EnableClock(kCLOCK_GatePORT3);
    /* INPUTMUX0 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kINPUTMUX0_RST_SHIFT_RSTn);
    /* FLEXPWM1 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kFLEXPWM1_RST_SHIFT_RSTn);
    /* PORT3 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kPORT3_RST_SHIFT_RSTn);
    /*  Cmp0Out connect to FlexPwm1Fault 0 */
    INPUTMUX_AttachSignal(INPUTMUX0, 0U, kINPUTMUX_Cmp0OutToFlexPwm1Fault);

    /* PORT3_12 (pin 63) is configured as PWM1_A2 */
    PORT_SetPinMux(BOARD_INITPWM1PINS_MC2_CT_PORT, BOARD_INITPWM1PINS_MC2_CT_PIN, kPORT_MuxAlt7);

    PORT3->PCR[12] = ((PORT3->PCR[12] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT3_13 (pin 62) is configured as PWM1_B2 */
    PORT_SetPinMux(BOARD_INITPWM1PINS_MC2_CB_PORT, BOARD_INITPWM1PINS_MC2_CB_PIN, kPORT_MuxAlt7);

    PORT3->PCR[13] = ((PORT3->PCR[13] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT3_14 (pin 61) is configured as PWM1_A1 */
    PORT_SetPinMux(BOARD_INITPWM1PINS_MC2_BT_PORT, BOARD_INITPWM1PINS_MC2_BT_PIN, kPORT_MuxAlt7);

