nxp-appcodehub/dm-mc-pmsm-triple-mcxa34x/board/pin_mux.c
    PORT3->PCR[14] = ((PORT3->PCR[14] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT3_15 (pin 60) is configured as PWM1_B1 */
    PORT_SetPinMux(BOARD_INITPWM1PINS_MC2_BB_PORT, BOARD_INITPWM1PINS_MC2_BB_PIN, kPORT_MuxAlt7);

    PORT3->PCR[15] = ((PORT3->PCR[15] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT3_16 (pin 59) is configured as PWM1_A0 */
    PORT_SetPinMux(BOARD_INITPWM1PINS_MC2_AT_PORT, BOARD_INITPWM1PINS_MC2_AT_PIN, kPORT_MuxAlt7);

    PORT3->PCR[16] = ((PORT3->PCR[16] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT3_17 (pin 58) is configured as PWM1_B0 */
    PORT_SetPinMux(BOARD_INITPWM1PINS_MC2_AB_PORT, BOARD_INITPWM1PINS_MC2_AB_PIN, kPORT_MuxAlt7);

    PORT3->PCR[17] = ((PORT3->PCR[17] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT3_27 (pin 52) is configured as PWM1_A3 */
    PORT_SetPinMux(BOARD_INITPWM1PINS_MC3_AT_PORT, BOARD_INITPWM1PINS_MC3_AT_PIN, kPORT_MuxAlt7);

    PORT3->PCR[27] = ((PORT3->PCR[27] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT3_28 (pin 51) is configured as PWM1_B3 */
    PORT_SetPinMux(BOARD_INITPWM1PINS_MC3_AB_PORT, BOARD_INITPWM1PINS_MC3_AB_PIN, kPORT_MuxAlt7);

    PORT3->PCR[28] = ((PORT3->PCR[28] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitADC0Pins:
- options: {callFromInitBoot: 'true', coreID: cm33_core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '87', peripheral: ADC0, signal: 'A, 10', pin_signal: P0_20/WUU0_IN4/LPUART0_RXD/CT_INP0/EZH_PIO10/CMP2_OUT/ADC0_A10, identifier: MC1_I_phA}
  - {pin_num: '88', peripheral: ADC0, signal: 'A, 11', pin_signal: P0_21/LPUART0_TXD/CT_INP1/EZH_PIO11/ADC0_A11, identifier: MC1_I_phB}
  - {pin_num: '89', peripheral: ADC0, signal: 'A, 12', pin_signal: P0_22/LPUART0_RTS_B/CT_INP2/CT0_MAT0/EZH_PIO12/ADC0_A12}
  - {pin_num: '90', peripheral: ADC0, signal: 'A, 13', pin_signal: P0_23/WUU0_IN5/LPUART0_CTS_B/CT_INP3/CT0_MAT1/EZH_PIO13/ADC0_A13/CMP2_IN2}
  - {pin_num: '99', peripheral: ADC0, signal: 'A, 22', pin_signal: P1_6/TRIG_IN2/LPSPI0_PCS1/LPUART2_RTS_B/CT_INP6/CT4_MAT0/EZH_PIO2/ADC0_A22, identifier: MC1_Temp_IPM}
  - {pin_num: '100', peripheral: ADC0, signal: 'A, 23', pin_signal: P1_7/WUU0_IN9/TRIG_OUT2/LPUART2_CTS_B/CT_INP7/CT4_MAT1/EZH_PIO3/ADC0_A23, identifier: MC1_TA}
  - {pin_num: '85', peripheral: ADC0, signal: 'A, 8', pin_signal: P0_18/LPI2C0_SCLS/CT0_MAT2/EZH_PIO8/CMP0_OUT/ADC0_A8}
  - {pin_num: '86', peripheral: ADC0, signal: 'A, 9', pin_signal: P0_19/WUU0_IN3/LPI2C0_SDAS/CT0_MAT3/EZH_PIO9/CMP1_OUT/ADC0_A9}
  - {pin_num: '98', peripheral: ADC0, signal: 'A, 21', pin_signal: P1_5/FREQME_CLK_IN1/LPSPI0_PCS2/LPUART2_TXD/CT1_MAT3/EZH_PIO1/ADC0_A21/CMP1_IN2, identifier: MC1_VOLT_DCB}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitADC0Pins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitADC0Pins(void)
{
    /* PORT0: Peripheral clock is enabled */
    CLOCK_EnableClock(kCLOCK_GatePORT0);
    /* PORT1: Peripheral clock is enabled */
    CLOCK_EnableClock(kCLOCK_GatePORT1);
    /* ADC0 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kADC0_RST_SHIFT_RSTn);
    /* PORT0 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kPORT0_RST_SHIFT_RSTn);
    /* CMP2 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kCMP2_RST_SHIFT_RSTn);
    /* PORT1 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kPORT1_RST_SHIFT_RSTn);

    /* PORT0_18 (pin 85) is configured as ADC0_A8 */
    PORT_SetPinMux(BOARD_INITADC0PINS_I_pfc1_PORT, BOARD_INITADC0PINS_I_pfc1_PIN, kPORT_MuxAlt0);

    PORT0->PCR[18] = ((PORT0->PCR[18] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Disables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe0));

    /* PORT0_19 (pin 86) is configured as ADC0_A9 */
    PORT_SetPinMux(BOARD_INITADC0PINS_I_pfc2_PORT, BOARD_INITADC0PINS_I_pfc2_PIN, kPORT_MuxAlt0);

    PORT0->PCR[19] = ((PORT0->PCR[19] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Disables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe0));

    /* PORT0_20 (pin 87) is configured as ADC0_A10 */
    PORT_SetPinMux(BOARD_INITADC0PINS_MC1_I_phA_PORT, BOARD_INITADC0PINS_MC1_I_phA_PIN, kPORT_MuxAlt0);

    PORT0->PCR[20] = ((PORT0->PCR[20] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Disables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe0));

    /* PORT0_21 (pin 88) is configured as ADC0_A11 */
    PORT_SetPinMux(BOARD_INITADC0PINS_MC1_I_phB_PORT, BOARD_INITADC0PINS_MC1_I_phB_PIN, kPORT_MuxAlt0);

    PORT0->PCR[21] = ((PORT0->PCR[21] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Disables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe0));

    /* PORT0_22 (pin 89) is configured as ADC0_A12 */
    PORT_SetPinMux(BOARD_INITADC0PINS_MC1_I_phC_PORT, BOARD_INITADC0PINS_MC1_I_phC_PIN, kPORT_MuxAlt0);

    PORT0->PCR[22] = ((PORT0->PCR[22] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Disables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe0));

    /* PORT0_23 (pin 90) is configured as ADC0_A13 */
    PORT_SetPinMux(BOARD_INITADC0PINS_MC1_CUR_DCB_PORT, BOARD_INITADC0PINS_MC1_CUR_DCB_PIN, kPORT_MuxAlt0);

