nxp-appcodehub/dm-mc-pmsm-triple-mcxa34x/board/pin_mux.c
    PORT0->PCR[23] = ((PORT0->PCR[23] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Disables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe0));

    /* PORT1_5 (pin 98) is configured as ADC0_A21 */
    PORT_SetPinMux(BOARD_INITADC0PINS_MC1_VOLT_DCB_PORT, BOARD_INITADC0PINS_MC1_VOLT_DCB_PIN, kPORT_MuxAlt0);

    PORT1->PCR[5] = ((PORT1->PCR[5] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_IBE_MASK)))

                     /* Input Buffer Enable: Disables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe0));

    /* PORT1_6 (pin 99) is configured as ADC0_A22 */
    PORT_SetPinMux(BOARD_INITADC0PINS_MC1_Temp_IPM_PORT, BOARD_INITADC0PINS_MC1_Temp_IPM_PIN, kPORT_MuxAlt0);

    PORT1->PCR[6] = ((PORT1->PCR[6] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_IBE_MASK)))

                     /* Input Buffer Enable: Disables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe0));

    /* PORT1_7 (pin 100) is configured as ADC0_A23 */
    PORT_SetPinMux(BOARD_INITADC0PINS_MC1_TA_PORT, BOARD_INITADC0PINS_MC1_TA_PIN, kPORT_MuxAlt0);

    PORT1->PCR[7] = ((PORT1->PCR[7] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_IBE_MASK)))

                     /* Input Buffer Enable: Disables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe0));
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitADC1Pins:
- options: {callFromInitBoot: 'true', coreID: cm33_core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '3', peripheral: ADC1, signal: 'A, 8', pin_signal: P1_10/LPUART1_RTS_B/LPI2C2_SDAS/CT2_MAT0/EZH_PIO6/LPUART5_TXD/CAN0_TXD/ADC1_A8, identifier: MC2_I_phA}
  - {pin_num: '4', peripheral: ADC1, signal: 'A, 9', pin_signal: P1_11/WUU0_IN11/TRIG_OUT2/LPUART1_CTS_B/LPI2C2_SCLS/CT2_MAT1/EZH_PIO7/LPUART5_RXD/CAN0_RXD/ADC1_A9,
    identifier: MC2_I_phB}
  - {pin_num: '5', peripheral: ADC1, signal: 'A, 10', pin_signal: P1_12/WUU0_IN12/LPI2C1_SDA/LPUART2_RXD/CT2_MAT2/EZH_PIO8/LPUART5_CTS_B/ADC1_A10, identifier: MC2_I_phC}
  - {pin_num: '7', peripheral: ADC1, signal: 'A, 12', pin_signal: P1_14/LPI2C1_SCLS/LPUART2_RTS_B/CT3_MAT0/EZH_PIO10/ADC1_A12}
  - {pin_num: '6', peripheral: ADC1, signal: 'A, 11', pin_signal: P1_13/TRIG_IN3/LPI2C1_SCL/LPUART2_TXD/CT2_MAT3/EZH_PIO9/LPUART5_RTS_B/ADC1_A11, identifier: MC2_VOLT_DCB}
  - {pin_num: '8', peripheral: ADC1, signal: 'A, 13', pin_signal: P1_15/WUU0_IN13/LPI2C1_SDAS/LPUART2_CTS_B/CT3_MAT1/EZH_PIO11/ADC1_A13, identifier: MC3_I_phA}
  - {pin_num: '23', peripheral: ADC1, signal: 'A, 0', pin_signal: P2_1/TRIG_IN7/LPUART0_TXD/LPUART4_RTS_B/CT_INP17/CT2_MAT1/EZH_PIO25/ADC1_A0/OPAMP2_INN}
  - {pin_num: '27', peripheral: ADC1, signal: 'A, 1', pin_signal: P2_5/LPUART2_RTS_B/CT_INP15/CT1_MAT1/EZH_PIO29/ADC1_A1/ADC3_A0, identifier: MC3_I_phC}
  - {pin_num: '49', peripheral: ADC1, signal: 'A, 21', pin_signal: P3_30/TRIG_OUT6/LPI2C3_SCLS/LPUART4_RTS_B/CT0_MAT2/PWM1_A0/EZH_PIO30/ADC1_A21, identifier: MC3_VOLT_DCB}
  - {pin_num: '25', peripheral: ADC1, signal: 'A, 4', pin_signal: P2_3/WUU0_IN19/TRIG_IN7/LPUART0_CTS_B/LPUART2_RXD/CT_INP13/CT2_MAT3/EZH_PIO27/ADC0_A3/CMP1_IN0/ADC1_A4}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitADC1Pins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitADC1Pins(void)
{
    /* PORT1: Peripheral clock is enabled */
    CLOCK_EnableClock(kCLOCK_GatePORT1);
    /* PORT2: Peripheral clock is enabled */
    CLOCK_EnableClock(kCLOCK_GatePORT2);
    /* PORT3: Peripheral clock is enabled */
    CLOCK_EnableClock(kCLOCK_GatePORT3);
    /* ADC1 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kADC1_RST_SHIFT_RSTn);
    /* PORT1 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kPORT1_RST_SHIFT_RSTn);
    /* PORT2 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kPORT2_RST_SHIFT_RSTn);
    /* CMP1 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kCMP1_RST_SHIFT_RSTn);
    /* PORT3 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kPORT3_RST_SHIFT_RSTn);

    /* PORT1_10 (pin 3) is configured as ADC1_A8 */
    PORT_SetPinMux(BOARD_INITADC1PINS_MC2_I_phA_PORT, BOARD_INITADC1PINS_MC2_I_phA_PIN, kPORT_MuxAlt0);

    PORT1->PCR[10] = ((PORT1->PCR[10] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Disables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe0));

    /* PORT1_11 (pin 4) is configured as ADC1_A9 */
    PORT_SetPinMux(BOARD_INITADC1PINS_MC2_I_phB_PORT, BOARD_INITADC1PINS_MC2_I_phB_PIN, kPORT_MuxAlt0);

    PORT1->PCR[11] = ((PORT1->PCR[11] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Disables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe0));

    /* PORT1_12 (pin 5) is configured as ADC1_A10 */
    PORT_SetPinMux(BOARD_INITADC1PINS_MC2_I_phC_PORT, BOARD_INITADC1PINS_MC2_I_phC_PIN, kPORT_MuxAlt0);

    PORT1->PCR[12] = ((PORT1->PCR[12] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Disables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe0));

    /* PORT1_13 (pin 6) is configured as ADC1_A11 */
    PORT_SetPinMux(BOARD_INITADC1PINS_MC2_VOLT_DCB_PORT, BOARD_INITADC1PINS_MC2_VOLT_DCB_PIN, kPORT_MuxAlt0);

    PORT1->PCR[13] = ((PORT1->PCR[13] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Disables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe0));

    /* PORT1_14 (pin 7) is configured as ADC1_A12 */
    PORT_SetPinMux(BOARD_INITADC1PINS_MC2_CUR_DCB_PORT, BOARD_INITADC1PINS_MC2_CUR_DCB_PIN, kPORT_MuxAlt0);

    PORT1->PCR[14] = ((PORT1->PCR[14] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Disables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe0));

    /* PORT1_15 (pin 8) is configured as ADC1_A13 */
    PORT_SetPinMux(BOARD_INITADC1PINS_MC3_I_phA_PORT, BOARD_INITADC1PINS_MC3_I_phA_PIN, kPORT_MuxAlt0);

