nxp-appcodehub/dm-mc-pmsm-triple-mcxa34x/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_SmartDMA0Pins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_SmartDMA0Pins(void)
{
    /* GPIO3: Peripheral clock is enabled */
    CLOCK_EnableClock(kCLOCK_GateGPIO3);
    /* PORT3: Peripheral clock is enabled */
    CLOCK_EnableClock(kCLOCK_GatePORT3);
    /* GPIO3 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kGPIO3_RST_SHIFT_RSTn);
    /* PORT3 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kPORT3_RST_SHIFT_RSTn);

    gpio_pin_config_t MC3_CT_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO3_19 (pin 56)  */
    GPIO_PinInit(BOARD_SMARTDMA0PINS_MC3_CT_GPIO, BOARD_SMARTDMA0PINS_MC3_CT_PIN, &MC3_CT_config);

    gpio_pin_config_t MC3_CB_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO3_20 (pin 55)  */
    GPIO_PinInit(BOARD_SMARTDMA0PINS_MC3_CB_GPIO, BOARD_SMARTDMA0PINS_MC3_CB_PIN, &MC3_CB_config);

    gpio_pin_config_t MC3_BB_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO3_21 (pin 54)  */
    GPIO_PinInit(BOARD_SMARTDMA0PINS_MC3_BB_GPIO, BOARD_SMARTDMA0PINS_MC3_BB_PIN, &MC3_BB_config);

    gpio_pin_config_t MC3_BT_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO3_22 (pin 53)  */
    GPIO_PinInit(BOARD_SMARTDMA0PINS_MC3_BT_GPIO, BOARD_SMARTDMA0PINS_MC3_BT_PIN, &MC3_BT_config);

    /* PORT3_19 (pin 56) is configured as P3_19 */
    PORT_SetPinMux(BOARD_SMARTDMA0PINS_MC3_CT_PORT, BOARD_SMARTDMA0PINS_MC3_CT_PIN, kPORT_MuxAlt0);

    PORT3->PCR[19] = ((PORT3->PCR[19] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT3_20 (pin 55) is configured as P3_20 */
    PORT_SetPinMux(BOARD_SMARTDMA0PINS_MC3_CB_PORT, BOARD_SMARTDMA0PINS_MC3_CB_PIN, kPORT_MuxAlt0);

    PORT3->PCR[20] = ((PORT3->PCR[20] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT3_21 (pin 54) is configured as P3_21 */
    PORT_SetPinMux(BOARD_SMARTDMA0PINS_MC3_BB_PORT, BOARD_SMARTDMA0PINS_MC3_BB_PIN, kPORT_MuxAlt0);

    PORT3->PCR[21] = ((PORT3->PCR[21] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT3_22 (pin 53) is configured as P3_22 */
    PORT_SetPinMux(BOARD_SMARTDMA0PINS_MC3_BT_PORT, BOARD_SMARTDMA0PINS_MC3_BT_PIN, kPORT_MuxAlt0);

    PORT3->PCR[22] = ((PORT3->PCR[22] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_eQDC0Pins:
- options: {callFromInitBoot: 'true', coreID: cm33_core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '40', peripheral: eQDC0, signal: PHASEA, pin_signal: P2_20/TRIG_IN8/LPSPI1_PCS2/CT2_MAT0/EZH_PIO22/ADC2_A6/OPAMP3_INP}
  - {pin_num: '41', peripheral: eQDC0, signal: PHASEB, pin_signal: P2_21/TRIG_IN9/LPSPI1_PCS3/CT2_MAT1/EZH_PIO23/ADC3_A6/OPAMP3_INN}
  - {pin_num: '48', peripheral: eQDC0, signal: INDEX, pin_signal: P3_31/LPTMR0_ALT2/TRIG_IN10/LPI2C3_SDAS/LPUART4_CTS_B/CT0_MAT3/PWM1_B0/EZH_PIO31/ADC1_A20, identifier: MC1_ENC_I}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_eQDC0Pins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_eQDC0Pins(void)
{
    /* INPUTMUX0: Peripheral clock is enabled */
    CLOCK_EnableClock(kCLOCK_GateINPUTMUX0);
    /* PORT2: Peripheral clock is enabled */
    CLOCK_EnableClock(kCLOCK_GatePORT2);
    /* PORT3: Peripheral clock is enabled */
    CLOCK_EnableClock(kCLOCK_GatePORT3);
    /* INPUTMUX0 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kINPUTMUX0_RST_SHIFT_RSTn);
    /* PORT2 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kPORT2_RST_SHIFT_RSTn);
    /* PORT3 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kPORT3_RST_SHIFT_RSTn);
    /*  TrigIn10 connect to Qdc0Index 0 */
    INPUTMUX_AttachSignal(INPUTMUX0, 0U, kINPUTMUX_TrigIn10ToQdc0Index);
    /*  TrigIn8 connect to Qdc0Phasea 0 */
    INPUTMUX_AttachSignal(INPUTMUX0, 0U, kINPUTMUX_TrigIn8ToQdc0Phasea);
    /*  TrigIn9 connect to Qdc0Phaseb 0 */
    INPUTMUX_AttachSignal(INPUTMUX0, 0U, kINPUTMUX_TrigIn9ToQdc0Phaseb);

    PORT2->PCR[20] = ((PORT2->PCR[20] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_MUX_MASK | PORT_PCR_IBE_MASK)))

                      /* Pin Multiplex Control: PORT2_20 (pin 40) is configured as TRIG_IN8. */
                      | PORT_PCR_MUX(PORT2_PCR20_MUX_mux01)

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

    PORT2->PCR[21] = ((PORT2->PCR[21] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_MUX_MASK | PORT_PCR_IBE_MASK)))

                      /* Pin Multiplex Control: PORT2_21 (pin 41) is configured as TRIG_IN9. */
                      | PORT_PCR_MUX(PORT2_PCR21_MUX_mux01)

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

